PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
/// @todo Clarify whether to use enum or unsigned int as device index. Make more transparent what device by enum is opposed to device by MPC pointer
/// @todo Check if we considered the dependencies on NO_MAILBOXES
/// @todo Check all global data objects if they are located in the right, protected section
/**
 * @file cdr_canDriver.c
 * CAN communication driver for DEVKIT-MPC5748G.
 *   The CAN device has two interesting but contradictory features: It supports sharing of
 * Rx mailboxes (MB) between several or many CAN IDs in the structure of a FIFO and it
 * supports CAN FD. Both features are essential but they can't be used at a time.
 * Therefore, the implementation needs to support two configuration and code structures.
 * The user needs to decide, which configuration to apply. Using the FIFO means other
 * interrupts and other constraints with respect to available CAN IDs.
 *

    @todo Use this text snippet in an overview documentation
    The partitioning of the mailbox RAM space of the CAN device is difficult as it opens a
    large range of possible configurations. It is not easily possible to decide, which one
    is best and, as a matter of fact, it'll always depend on the given network database. At
    the moment it is unclear to which extend this flexibility needs to be visible in the
    driver configuration. In the current stage, we implement one configuratio, which will
    suffice in many cases. This macro can't be changes as there are mutual dependencies with
    other settings.\n
           The use of the FIFO is not possible with CAN FD. If we enable CAN FD then we have
        the additional complexity of mailboxes of different size. Their total number depends on
        the chosen sizes and this can be hardly decided without knowing the specific network
        database to serve. Anyway, the total number of supported mailboxes will be significantly
        lower so that sharing of mailboxes will become unavoidable. This means another strong
        dependency of the driver configuration on the given network database. A generic driver
        configuration will be hard to find with CAN FD.


 * Copyright (C) 2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   cdr_getNoFIFOFilterEntries (global inline)
 *   cdr_getIdxOfFirstMailbox (global inline)
 *   cdr_getMailbox (global inline)
 *   configSIULForUseWithDEVKIT_MPC5748G
 *   cdr_osInitCanDriver
 *   cdr_osMakeMailboxReservation
 *   cdr_osSendMessage
 *   cdr_osSendMessageEx
 *   cdr_osReadMessage
 *   cdr_testSend_task10ms
 * Local functions
 *   getFIFOFilterEntry
 *   osPrepareSendMessage
 */

/// @todo Define object, which makes ISR implementation independent from CAN device
// Error/event counters, callback pointers, etc. A trampoline of separate, macro generated
// trivial functions will select the right object by reference and jump into the common
// implementation.

/*
 * Include files
 */

#include <stddef.h>
#include <stdio.h> /// @todo Remove after temporary use in initial test code
#include <string.h>
#include <limits.h>
#include <assert.h>

#include "MPC5748G.h"
#include "cdr_MPC5748G_CAN.h"

#include "typ_types.h"
#include "sio_serialIO.h"
#include "ccl_configureClocks.h"
#include "cdr_checkConfig.h"
#include "cdr_interruptServiceHandlers.h"
#include "cdr_canDriverAPI.h"
#include "cdr_canDriver.h"


/*
 * Defines
 */

/** Initializer expression for an entry of the array \a cdr_canDriverData. */
#define INIT_CAN_DEVICE_DATA(canDev)    \
    [cdr_canDev_##canDev] =             \
    {                                   \
        .isBusOff = false,              \
        .noRxFIFOOverflowEvents = 0,    \
        .noRxFIFOWarningEvents = 0,     \
        .noRxMsgsFIFO = 0,              \
    },

/*
 * Local type definitions
 */

/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/* Read the source code include file, which defines the large configuration data set. */
#define CDR_IS_INCLUDED_FROM_DRIVER_IMPLEMENTATION
#include "cdr_canDriver.config.inc"

/** This is a lookup table, which maps a zero based CAN device index (enumeration
    cdr_canDevice_t) to a CAN peripheral (according to MPC5748G.h) */
CAN_Type * const cdr_mapIdxToCanDevice[cdr_canDev_noCANDevicesEnabled] =
{
#if CDR_ENABLE_USE_OF_CAN_0 == 1
    CAN_0,
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
    CAN_1,
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
    CAN_2,
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
    CAN_3,
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
    CAN_4,
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
    CAN_5,
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
    CAN_6,
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
    CAN_7,
#endif
};


/** The run-time data of the CAN driver.\n
      The principal structure of the object is an array of objects of class \a
    cdr_canDeviceData_t, which hold the run-time data for a single CAN device (the
    devices are operated widely independent from one another). */
cdr_canDriverData_t DATA_OS(cdr_canDriverData) =
{
#if CDR_ENABLE_USE_OF_CAN_0 == 1
    INIT_CAN_DEVICE_DATA(CAN_0)
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
    INIT_CAN_DEVICE_DATA(CAN_1)
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
    INIT_CAN_DEVICE_DATA(CAN_2)
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
    INIT_CAN_DEVICE_DATA(CAN_3)
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
    INIT_CAN_DEVICE_DATA(CAN_4)
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
    INIT_CAN_DEVICE_DATA(CAN_5)
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
    INIT_CAN_DEVICE_DATA(CAN_6)
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
    INIT_CAN_DEVICE_DATA(CAN_7)
#endif
};
#undef INIT_CAN_DEVICE_DATA


