PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
/*
 * Function implementation
 */


/**
 * Get an entry from the FIFO filter table. In our configuration, an entry is of type A
 * only. Effectively it is the CAN ID, which can be received through the FIFO. See RM
 * 43.4.43, Tables 43-17 and 43-18, on p. 1786 for details.
 *   @return
 * The pointer to the filter entry is returned.
 *   @param pCanDevice
 * The CAN device in use is passed by reference. It'll be one entry out of #CAN_BASE_PTRS
 * (see MPC5748G.h); this is however not checked.
 *   @param idxFilterEntry
 * The index of the filter entry.\n
 * The range is 0..max, which is checked by assertion. "max" depends on the FIFO
 * configuration. In our default configuration (CTRL2[RFFN]=8) it is 71. See RM 43.4.14, p.
 * 1740.
 *   @remark
 * The current configuration of the device, e.g. FIFO enabled or not or the filter table
 * size, is not considered by the function. It just provides the simple address
 * calculation.
 */
static inline uint32_t *getFIFOFilterEntry( const CAN_Type * const pCanDevice
                                          , unsigned int idxFilterEntry
                                          )
{
/// @todo Modify function signature so that the asertion becomes possible again
//    assert(idxFilterEntry < 8u*(CTRL2_RFFN+1u) /* see RM p. 1740 */);
    /* The filter table starts a byte offset 0xe0, the RAM starts at byte offset 0x80. */
    return (uint32_t*)((uint8_t*)&pCanDevice->RAMn[0]
                       + (0xe0 - 0x80)
                       + idxFilterEntry*sizeof(uint32_t)
                      );
} /* End of getFIFOFilterEntry */





/**
 * Do the configuration of the MCU pins such that CAN device CAN_0 can communicated through
 * the CAN transceiver, which is mounted on the board.\n
 *   The code in this function is not generally usable.
 */
static void configSIULForUseWithDEVKIT_MPC5748G(void)
{
    /* RM 15.2.11, Multiplexed Signal Configuration Register, p. 388ff: Route Tx output of
       device CAN_0 to MCU pin PB0, which is connected to the Tx input of the external
       transceiver chip on the board DEVKIT-MPC5748G. */
    const unsigned int idxSIUL_PB0 = 16
                     , idxSIUL_PB1 = 17
                     , idxIMCR_PB1 = 188;
    SIUL2->MSCR[idxSIUL_PB0] =
                SIUL2_MSCR_SSS(1)   /* Source signal is CAN0_TX */
                | SIUL2_MSCR_SRC(3) /* Slew rate: Full drive without SR control */
                | SIUL2_MSCR_OBE(1) /* Enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(0) /* Disable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;

    /* Rx output of external transceiver chip is connected to pin PB1 of the MCU. Configure
       this pin as input. */
    SIUL2->MSCR[idxSIUL_PB1] =
                SIUL2_MSCR_SSS(0)   /* Doesn't care for input */
                | SIUL2_MSCR_SRC(0) /* Doesn't care for input */
                | SIUL2_MSCR_OBE(0) /* Don't enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(1) /* Enable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;

    /* RM 15.2.12, p. 391, input multiplexer: Rx output of external transceiver chip is
       connected to pin PB1 of the MCU. Route PB1 to the Rx input of CAN device CAN_0. */
    SIUL2->IMCR[idxIMCR_PB1] = SIUL2_IMCR_SSS(2);

} /* End of configSIULForUseWithDEVKIT_MPC5748G */




/**
 * Initialization of one CAN device. This function is called once per enabled CAN device
 * from the driver initialization.
 *   @return
 * \a true, if function succeeded, else \a false.
 *   @param idxCanDevice
 * The CAN device to initialize by index. The available index range depends on the
 * configuration of the set of enabled CAN devices, see e.g. #CDR_ENABLE_USE_OF_CAN_0. The
 * most convenient way to provide the appropriate index is using enumeration
 * cdr_canDevice_t.
 *   @remark
 * Needs to be called from supervisor code only.
 */
static void initCanDevice(unsigned int idxCanDevice)
{
    /* Look up the CAN device and the related driver configuration. */
    _Static_assert( sizeOfAry(cdr_canDriverConfig) == sizeOfAry(cdr_mapIdxToCanDevice)
                  , "Invalid CAN driver configuration"
                  );
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    CAN_Type * const pCanDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pCanDevConfig = &cdr_canDriverConfig[idxCanDevice];

    /* RM 43.6.1, initialization: First, we need to bring the device in disabled mode to
       set the clock source. On leaving the disabled mode, the device automatically enters
       the freeze mode, which is a prerequisite for being able to write the majority of
       registers. After configuration of all needed registers, we leave the freeze mode and
       the device becomes active.
         Note, a (soft) reset of the device is possible. Maybe, we need to consider it if
       we implement a re-initialization of the driver. The current implementation is proven
       only after out-of-reset. */

    /* Demand disable mode by setting the bit MDIS and wait for acknowledge. */
    pCanDevice->MCR |= CAN_MCR_MDIS_MASK;
    #define STS_MASK_DISABLED   (CAN_MCR_MDIS_MASK | CAN_MCR_NOTRDY_MASK | CAN_MCR_LPMACK_MASK)
    while((pCanDevice->MCR & STS_MASK_DISABLED) != STS_MASK_DISABLED)
        ;
    #undef STS_MASK_DISABLED

