PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    /* The error/status word CAN_ESR1 contains some interrupt flag bits, which we reset by
       w1c. */
    pCanDevice->ESR1 = CAN_ESR1_ERROVR_MASK
                       | CAN_ESR1_ERRINT_FAST_MASK
                       | CAN_ESR1_BOFFDONEINT_MASK
                       | CAN_ESR1_TWRNINT_MASK
                       | CAN_ESR1_RWRNINT_MASK
                       | CAN_ESR1_BOFFINT_MASK
                       | CAN_ESR1_ERRINT_MASK
                       | CAN_ESR1_WAKINT_MASK
                       ;
    //pCanDevice->ESR2 is a read-only status register. (RM 43.4.15, p. 1742f.)

    /* RM 43.4.17, CAN_RXFGMASK. The register is the acceptance mask, which selects the
       do-care bits from some of the individual FIFO acceptance filters. See RM, p. 1740
       for a table. For example, with CTRL2[RFFN]=8, we use this global mask for filters
       24-71, whereas the first filters, 0-23, have individual acceptance masks (RM
       43.4.22, CAN_RXIMRn, n=0..23).
         We use filters with all ID bits (CTRL1[IDAM]=0) and we assert all bits in the mask
       to force a match of the entire ID for messages going into the FIFO. */
    pCanDevice->RXFGMASK = CAN_RXFGMASK_FGM_MASK;

    /* RM, 43.4.22, CAN_RXIMRn (Rx Individual Mask Registers): They are initialized
       together with the mail boxes. Each mail box has its corresponding mask register. */

    /* RM 43.4.19, CAN_CBT. This register would be used if CAN FD is enabled. It provides
       the same timing settings that we have already configured in CAN_CTRL1 (the clock
       divider and the segment lengths) but it spends broader ranges as needed for the CAN
       FD timing. Writing this register would internally overwrite the according settings
       made in CAN_CTRL1. */
    //pCanDevice->CBT =

    /* The interrupts are initially disabled with the exception of the Rx FIFO interrupt.
       The mailbox related interrupts can be decided only later, when actual CAN messages
       are registered for Tx or Rx. See RM 43.4.11/10/20.
         We enable all FIFO interrupts. */
    pCanDevice->IMASK1 = 0x000000e0; /* Why don't we have specific mask macros here? */
    pCanDevice->IMASK2 = CAN_IMASK2_BUF63TO32M(0);
    pCanDevice->IMASK3 = CAN_IMASK3_BUF95TO64M(0);

    /* The remaining registers are not touched for now. They relate to
       - pretended networking
       - CAN wake-up
       - CAN FD */

    /* RM, 43.4.22, p. 1749: We set all mailbox mask registers. Because we have plenty of
       mailboxes no sharing of mailboxes between several CAN IDs will ever be required and
       we set them all to "all CAN ID bits care". This make using the CAN driver most
       simple. */
    unsigned int u;
    for(u=0; u<CAN_RXIMR_COUNT; ++u)
        pCanDevice->RXIMR[u] = CAN_RXIMR_MI_MASK;

    /* RM, 43.5.8.2, p. 1812: Clear the FIFO. Before we need to clear all related three
       interrupt flags. IFLAG1: See RM 43.4.13, p. 1736ff. */
    pCanDevice->IFLAG1 = CAN_IFLAG1_BUF7I_MASK
                         | CAN_IFLAG1_BUF6I_MASK
                         | CAN_IFLAG1_BUF5I_MASK
                         ;
    pCanDevice->IFLAG1 = CAN_IFLAG1_BUF0I_MASK; /* This initiates the clear. */

    /* Initialize the FIFO filter table. See RM 43.4.43, p. 1785ff, for the binary
       structure.
         See RM 43.4.14, table on p. 1740, for the number of table entries depending on
       CTRL2[RFFN]. */
    const unsigned int noFilterTableEntries = cdr_getNoFIFOFilterEntries(pCanDevConfig);
    for(u=0; u<noFilterTableEntries; ++u)
    {
        /* The FIFO filters don't have a state "disabled" like normal mailboxes have. If we
           initialize them to zero then standard CAN ID 0 will be received. Although this
           is normally not in use and not an issue, it is a potential risk for attacs.
           Bursts of CAN ID 0 Rx messages could produce high interrupt load and even
           confuse some application SW, which gets a callback with a message notification
           for a message it had never registered.
             As a countermeasure we initialize the filter such that the situation becomes
           more unlikely. We set IDE bit to react only on the less common extended IDs and
           we set the bit RTR, which rejects normal data messages. Setting the filter to
           the CAN ID of lowest priority further lowers the risk of blocking by message
           burst. */
        *getFIFOFilterEntry(pCanDevice, u) =
                CAN_FIFOFILTER_RTR(1)/* 0: Accept normal data frames, 1: Remote fr. */
                | CAN_FIFOFILTER_IDE(1)  /* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                | CAN_FIFOFILTER_RXIDA_EXT(0x1fffffffu) /* CAN ID, all 29 ext. bits */
                ;
    } /* End for(All FIFO filter table entries) */

    /* Reset all normal mailboxes. Caution, this code depends on the FIFO enable and the
       chosen size of the FIFO filter table, see RM 43.4.14, table on p. 1740. */
    const unsigned int idxFirstMB = cdr_getIdxOfFirstMailbox(pCanDevConfig);
    _Static_assert(CAN_RXIMR_COUNT == 96, "Missing macro for available number of mailboxes");
    volatile cdr_mailbox_t *pMB = cdr_getMailbox(pCanDevice, idxFirstMB);
    assert((void*)getFIFOFilterEntry(pCanDevice, noFilterTableEntries) == (void*)pMB);
    for(u=idxFirstMB; u<CAN_RXIMR_COUNT; ++u, ++pMB)
    {
        /* See RM 43.4.40, p. 1771, for the fields of the mailbox. See Table 43-8, p.
           1772ff, for the Rx mailbox status and command CODEs. */
        pMB->csWord = CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                      | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                      | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                      | CAN_MBCS_CODE(0)/* 0, INACTIVE, makes it a disabled Rx mailbox */
                      | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                      | CAN_MBCS_IDE(0) /* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                      | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                      | CAN_MBCS_DLC(0) /* Size of frame, doesn't care for Rx. */
                      | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care is set on transmission */
                      ;
        pMB->canId = CAN_MBID_PRIO(0)       /* We don't use the local prio value. */
                     | CAN_MBID_ID_EXT(0)   /* All 29 Bits of CAN ID set to zero for now. */
                     ;

    } /* End for(All normal MBs) */
    assert((void*)pMB == (void*)&pCanDevice->RAMn[CAN_RAMn_COUNT]);

    /* Configure the MCU pins so that the external circuitry is connected to the MCU
       internal CAN device we've just configured. */
    configSIULForUseWithDEVKIT_MPC5748G();

