PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    CAN_Type * const pDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pDeviceConfig = &cdr_canDriverConfig[idxCanDevice];

    if(isExtId && (canId & 0xe0000000u) != 0  ||  !isExtId && (canId & 0xfffff800u) != 0)
        return cdr_errApi_badCanId;

    /* With enabled FIFO, the first mailboxes are not in normal operation and the
       configuration differs.
         The message handle space for the client code appends the normal mailboxes to the
       FIFO filter entries. */
    const unsigned int noFIFOMsgs = cdr_getNoFIFOFilterEntries(pDeviceConfig)
                     , idxFirstNormalMailbox = cdr_getIdxOfFirstMailbox(pDeviceConfig);
    if(hMB < noFIFOMsgs)
    {
        /* The reservation addresses to a FIFO Rx mailbox. Tx is forbidden and a
           notification request is essential, since FIFO mailboxes can't be read by
           polling. */

        /* In the FIFO context, the "mailbox handle" actually is the index of the FIFO
           filter table entry. */
        const unsigned int idxFilterEntry = hMB;

        if(!isReceived)
            return cdr_errApi_fifoMailboxUsedForTx;
        if(!doNotify)
            return cdr_errApi_fifoMailboxRequiresNotification;

        /* Check if the same mailbox had been requested already in an earlier function
           call. Although it would be technically possible to reconfigure a mailbox in a
           repeated call, it is nearly certain that this rather points to an error in the
           client code. This is why we don't allow it. */
        uint32_t const rxFilterBefore = *getFIFOFilterEntry(pDevice, idxFilterEntry);
        if(rxFilterBefore != (CAN_FIFOFILTER_RTR(1)
                              | CAN_FIFOFILTER_IDE(1)
                              | CAN_FIFOFILTER_RXIDA_EXT(0x1fffffffu)
                             )
          )
        {
            return cdr_errApi_mailboxReconfigured;
        }

        uint32_t const rxFilter = CAN_FIFOFILTER_RTR(0)
                                  | (isExtId
                                     ? (CAN_FIFOFILTER_IDE(1u)|CAN_FIFOFILTER_RXIDA_EXT(canId))
                                     : (CAN_FIFOFILTER_IDE(0u)|CAN_FIFOFILTER_RXIDA_STD(canId))
                                    );
        *getFIFOFilterEntry(pDevice, idxFilterEntry) = rxFilter;
    }
    else if(hMB + idxFirstNormalMailbox < noFIFOMsgs + pDeviceConfig->noMailboxes)
    {
        /* A normal mailbox is reserved. */

        /* hMB needs a simple transformation to become the index of the mailboxes in the
           device. */
        const unsigned int idxMB = hMB + idxFirstNormalMailbox - noFIFOMsgs;
        assert(idxMB < pDeviceConfig->noMailboxes);

        volatile cdr_mailbox_t * const pMB = cdr_getMailbox(pDevice, idxMB);

        if((pMB->csWord & (CAN_MBCS_CODE_MASK | CAN_MBCS_IDE_MASK)) != 0)
            return cdr_errApi_mailboxReconfigured;

        /* Check if demand for notification is plausible with respect to the driver
           configuration. Macro #CHECK_GROUP_IRQ returns true if there's no implausibility
           for IRQ group [from, to].
             (int)idxMB: The type cast in the condition has no impact on the result of the
           possible decisions but hinders the compiler from issuing a warning becasue of
           otherwise comparing an unsigned value on greater or equal to zero (always true,
           -Wtype-limits). */
        #define CHECK_GROUP_IRQ(from, to)                                                   \
                (!((int)idxMB >= (from)  &&  idxMB <= (to))                                 \
                 || (pDeviceConfig->irqGroupMB##from##_##to.irqPrio > 0                     \
                     && (isReceived? pDeviceConfig->irqGroupMB##from##_##to.osCallbackOnRx  \
                                     != NULL                                                \
                                   : pDeviceConfig->irqGroupMB##from##_##to.osCallbackOnTx  \
                                     != NULL                                                \
                        )                                                                \
                    )                                                                       \
                )
        if(doNotify
           && (!CHECK_GROUP_IRQ(0, 3)
               || !CHECK_GROUP_IRQ(4, 7)
               || !CHECK_GROUP_IRQ(8, 11)
               || !CHECK_GROUP_IRQ(12, 15)
               || !CHECK_GROUP_IRQ(16, 31)
               || !CHECK_GROUP_IRQ(32, 63)
               || !CHECK_GROUP_IRQ(64, 95)
              )
          )
        {
            return cdr_errApi_notificationWithoutIRQ;
        }
        #undef CHECK_GROUP_IRQ

        /* Clear a possibly pending interrupt bit (RM 43.4.12/13/21, p. 1735ff) and enable
           the interrupt for the given mailbox (RM 43.4.11/10/20). */
        if(idxMB < 32)
        {
            const uint32_t mask = 1u << idxMB;
            pDevice->IFLAG1 =  mask; /* Clear IRQ bit by "w1c". */
            if(doNotify)
                pDevice->IMASK1 |= mask; /* Set IRQ enable bit. */
            else
                assert((pDevice->IMASK1 & mask) == 0);
        }
        else if(idxMB < 64)
        {
            const uint32_t mask = 1u << (idxMB-32u);
            pDevice->IFLAG2 =  mask; /* Clear IRQ bit by "w1c". */
            if(doNotify)
                pDevice->IMASK2 |= mask; /* Set IRQ enable bit. */
            else
                assert((pDevice->IMASK2 & mask) == 0);
        }
        else
        {
            assert(idxMB < 96);
            const uint32_t mask = 1u << (idxMB-64u);
            pDevice->IFLAG3 =  mask; /* Clear IRQ bit by "w1c". */
            if(doNotify)
                pDevice->IMASK3 |= mask; /* Set IRQ enable bit. */
            else
                assert((pDevice->IMASK3 & mask) == 0);
        }

        const unsigned int CODE = isReceived
                                  ? 4   /* 0, EMPTY, makes it an empty, enabled Rx mailbox */
                                  : 8   /* 0, INACTIVE, makes it an empty, enable Tx mailbox */
                                  ;

