PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    /* hMB needs a simple transformation to become the index of the mailboxes in the
       device. */
    const unsigned int idxMB = hMB + idxFirstNormalMailbox - noFIFOMsgs;
    assert(idxMB < pDeviceConfig->noMailboxes);

    /* Identify the interrupt bit that belongs to the given mailbox (RM 43.4.12/13/21, p.
       1735ff). */
    uint32_t irqMask;
    volatile uint32_t *pIFLAG;
#ifdef DEBUG
    volatile uint32_t IMASK;
#endif
    if(idxMB < 32)
    {
        irqMask = 1u << idxMB;
        pIFLAG = &pDevice->IFLAG1;
#ifdef DEBUG
        IMASK = pDevice->IMASK1;
#endif
    }
    else if(idxMB < 64)
    {
        irqMask = 1u << (idxMB-32u);
        pIFLAG = &pDevice->IFLAG2;
#ifdef DEBUG
        IMASK = pDevice->IMASK2;
#endif
    }
    else
    {
        assert(idxMB < 96);
        irqMask = 1u << (idxMB-64u);
        pIFLAG = &pDevice->IFLAG3;
#ifdef DEBUG
        IMASK = pDevice->IMASK3;
#endif
    }

    /* To avoid race conditions, we don't allow using this API for mailboxes, which are
       configured to send an IRQ based notification. This is double-checked in DEBUG
       compilation. */
    assert((IMASK & irqMask) == 0);

    /* Poll for newly received input; a new message is reported by interrupt flag. */
    if((*pIFLAG & irqMask) != 0)
    {
        /* Get the pointer to the mailbox in use. */
        volatile cdr_mailbox_t * const pRxMB = cdr_getMailbox(pDevice, idxMB);

        /* Read status word of MB. Field CODE tells more about normal reception or
           overflow. */
        const uint32_t csWord = pRxMB->csWord
                     , CODE = (csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
        assert(CODE == 2 /* FULL */  ||  CODE == 6 /* OVERRUN */);
        const uint32_t DLC = (pRxMB->csWord & CAN_MBCS_DLC_MASK) >> CAN_MBCS_DLC_SHIFT;

        /* Copy received bytes into caller provided result buffer. The loop considers both
           the provided buffer's size and the number of received bytes. The received DLC is
           limited to 8 by HW. */
        assert(DLC <= 8);
        unsigned int u = *pDLC;
        if(u > DLC)
            u = DLC;
        while(u-- > 0)
            payload[u] = pRxMB->payload[u];
        *pDLC = DLC;

        /* Acknowledge the IRQ. */
        *pIFLAG = irqMask; /* Clear bit by "w1c" */

        /* RM 43.4.4, p. 1721f: Read the timer register to unlock the evaluated mailbox
           (side-effect of reading). See 43.5.7.3 Mailbox lock mechanism, p. 1808ff for
           more details. */
        (void)pDevice->TIMER;
        
        /* The time stamp of reception is returned on demand. */
        if(pTimeStamp != NULL)
            *pTimeStamp = (csWord & CAN_MBCS_TIME_STAMP_MASK) >> CAN_MBCS_TIME_STAMP_SHIFT;

        /* RM 43.4.9, p. 1727: The error word CAN_ESR1 is related to the last recently
           received message but the bits are sticky. If the status is read by the CPU then
           they are reset otherwise they are held. So the CPU should read the word on each
           Rx event and relate the bits to the received message.
             Careful: The bits are obviously meant to be read by interrupt (which is caused
           by them). Both at a time is impossible due to the reset-on-read and we tend to
           offer the interrupt. */

        return CODE == 2 /* FULL */? cdr_errApi_noError: cdr_errApi_warningRxOverflow;
    }
    else
        return cdr_errApi_rxMailboxEmpty;

} /* End of cdr_osReadMessage */



